app/controllers/event_dates_controller.rb

  def index
    @event_dates = EventDate.all
---
SELECT "event_dates".* FROM "event_dates"

    def set_event_date
      @event_date = EventDate.find(params[:id])
---
SELECT "event_dates".* FROM "event_dates" WHERE "event_dates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]