app/controllers/travel_iteneraries_controller.rb

SELECT "travel_iteneraries".* FROM "travel_iteneraries"
---
  def index
    @travel_iteneraries = TravelItenerary.all

SELECT "travel_iteneraries".* FROM "travel_iteneraries" WHERE "travel_iteneraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @travel_itenerary = TravelItenerary.find(params[:id])